const ruLang = document.getElementById("ru");
const uaLang = document.getElementById("ua");

const langSettings = {
  program: {
    ru: "Программа",
    ua: "Програма",
  },

  advantages: {
    ru: "Преимущества",
    ua: "Переваги",
  },
  reviews: {
    ru: "Отзывы",
    ua: "Відгуки",
  },
  about: {
    ru: "О нас",
    ua: "Про нас",
  },
  writeUs: {
    ru: "Написать нам",
    ua: "Написати нам",
  },
  successfulStart: {
    ru: "Твой успешный старт",
    ua: "Твій успішний старт",
  },
  title: {
    ru: "Научись находить прибыльные связи и лить на гемблу всего за 21 день",
    ua: "Навчись знаходити прибуткові звʼязки та лити на гемблу всього за 21 день",
  },
  introText: {
    ru: "Даем возможность овладеть арбитражом трафика БЕСПЛАТНО, сэкономить на расходниках более 250 долларов и попасть в нашу команду Mustage Friends",
    ua: "Даємо можливість опанувати арбітраж трафіку БЕЗКОШТОВНО, заощадити на розхідниках більше 250 доларів та потрапити в нашу команду Mustage Friends",
  },
  costs: {
    ru: "Без лишних затрат:",
    ua: "Без зайвих витрат:",
  },
  costsText: {
    ru: "покупаете только расходники",
    ua: "купуєте тільки розхідники",
  },
  support: {
    ru: "Высококлассная поддержка баеров:",
    ua: "Професійна підтримка баєрів:",
  },
  supportText: {
    ru: "почти 24/7",
    ua: "майже 24/7",
  },
  community: {
    ru: "Закрытое коммьюнити:",
    ua: "Закрите комʼюніті:",
  },
  communityText: {
    ru: "дополнительные фичи после курса",
    ua: "додаткові фічі після курсу",
  },
  delay: {
    ru: "Не медли, тебя ждет много «плюшек»",
    ua: "Не зволікай, на тебе чекає багато «плюшок»",
  },
  system: {
    ru: "Продуманная система обучения с практическим опытом",
    ua: "Продумана система навчання з практичним досвідом",
  },
  systemText: {
    ru: "Научим всему, что необходимо для успешного старта в арбитраже. Пройдя весь путь с нуля с нами, ты сможешь подбирать удачные оферы, составлять Т3 для конвертирующих креативов, пользоваться необходимыми сервисами и запускать рекламу в ФБ.",
    ua: "Навчимо усьому, що потрібно для успішного старту в арбітражі. Пройдучи весь шлях з нуля з нами, ти зможеш підбирати вдалі офери, складати Т3 для конвертуючих креативів, користуватися необхідними сервісами та запускати рекламу у ФБ.",
  },
  calls: {
    ru: "2 созвона с крутыми наставниками в Zoom",
    ua: "2 зідзвони з крутими наставниками в Zoom",
  },
  callsText: {
    ru: "Сможешь пообщаться с ТОПовыми баерами нашей команды и задать мне любые вопросы о тонкостях залива рекламы на гембл. Это мега возможность как для новичков, так и для работающих арбитражников.",
    ua: "Зможеш поспілкуватися зТОПовими баєрами нашої команди і поставити їм будь-які питання про тонкощі заливу реклами на гемблу. Це мега можливість як для новачків, так ідля діючих арбітражників.",
  },
  access: {
    ru: "Доступ к каналу и чату своего потока",
    ua: "Доступи до каналу і чату свого потоку",
  },
  accessText: {
    ru: "Будешь проходить курс с единомышленниками: не творить, обмениваться опытом, быстро решать проблемы. Так сможешь избежать ошибок, а также успешно и быстро стартовать в варбитраже.",
    ua: "Будеш проходити курс зоднодумцями: нетворкати, обмінюватися досвідом, швидко вирішувати проблеми. Так зможеш уникнути помилок, а також успішно ішвидко стартанути варбітражі.",
  },
  fastSupport: {
    ru: "Оперативный и чуткий сапорт",
    ua: "Оперативний та чуйний сапорт",
  },
  fastSupportText: {
    ru: "Что-то не так с домашкой, не получается привязать карты к аккаунтам, добавить прокси в антидетект браузер - эти и другие вопросы помогут решить наши эксперты-кураторы. Просто пиши нам в чат, и ответ получишь в течение 10 минут.",
    ua: "Щось не так здомашкою, не виходить прив'язати карти до акаунтів, додати проксі в антидетект браузер - ці та інші питання допоможуть розрулити наші експерти-куратори. Просто пиши нам у чат, і відповідь отримаєш протягом 10 хвилин.",
  },
  connect: {
    ru: "Удобный коннект через Telegram",
    ua: "Зручний конект через Telegram",
  },
  connectText: {
    ru: "Все учебные материалы будем публиковать на канале потока. Домашки и тесты будешь сдавать через бота, в котором всё удобно структурировано. По ним - детальный обратный связь от куратора.",
    ua: "Всі навчальні матеріали публікуватимемо на каналі потоку. Домашки і тести будеш здавати через бота, в якому все зручно структуровано. По ним - детальний зворотній звʼязок від куратора.",
  },
  possibility: {
    ru: "Возможность попасть в команду для каждого",
    ua: "Можливість потрапити в команду для кожного",
  },
  possibilityText: {
    ru: "Настойчиво учишься - проявляешь активность в чате - идешь дальше, несмотря на неудачи - стремишься к развитию в вертикали гемблинга. При таком раскладе после курса мы пригласим тебя в Mustage Friends, дадим специальную скидку на наши аккаунты и все сервисы для заливки БЕСПЛАТНО.",
    ua: "Наполегливо навчаєшся - проявляєш активність у чаті - ідеш далі, незважаючи на невдачі - прагнеш до розвитку у вертикалі гемблінгу. При такому розкладі після курсу ми запросимо тебе у Mustage Friends, надамо спеціальну знижку на наші акаунти та всі сервіси для заливу БЕЗКОШТОВНО.",
  },
};

const itemsToTranslate = document.querySelectorAll("[data-translate]");

uaLang.onclick = () => {
  itemsToTranslate.forEach((item) => {
    const keyToTranslate = item.getAttribute("data-translate");
    item.innerHTML = langSettings[keyToTranslate].ua;
  });
};

ruLang.onclick = () => {
  itemsToTranslate.forEach((item) => {
    const keyToTranslate = item.getAttribute("data-translate");
    item.innerText = langSettings[keyToTranslate].ru;
  });
};

const menu = document.getElementsByClassName("menu")[0];
const navMain = document.getElementsByClassName("header__main")[0];

menu.onclick = () => {
    menu.classList.toggle("menu-active");
    navMain.classList.toggle("header__main-active");
}